let count = 0;
let timer;
const maxInterval = 1000;

document.addEventListener('keydown', function (event) {
    if (event.key === 'r' || event.key === 'R') {
        count++;

        if (count === 1) {
            timer = setTimeout(resetCount, maxInterval);
        }
        if (count === 5) {
            document.body.style.fontFamily = 'inherit'
            resetCount();
        }
    } else {
        resetCount();
    }
});

function resetCount() {
    count = 0;
    clearTimeout(timer);
}
if (!window.location.href.includes('localhost')) {
    console.log('喵​‍‍​‍‌‍​‌‌‌‌‌‌​‍‍‌‍​‌‌‌​‍‍‍‍‌​‌‍‌‌‌​‌‌‌‍​‍‍​‍喵‌‍‌​‌‌‍‌‌​‌‍‍‍‍​‍‌‌‍‍​‌‌‌‌​‍‌‌​‍‍‍‌​‍‌‍‌​‍‍‍‌‍喵​‍‌‌‌‍​‌‌‌‌‍​‌‌‌‌‍​‌‍‍‍‌​‌‌‍‌‍​‍‌‌‌​‌‌‍‌​‍‌‌​‍喵？‌‌‌‍​‌‍‍‍​‍‌‍‍​‌‍‍‍‌​‌‍​‍‌‍‍​‌‌‌‌‌​‍‍​‌‍‌‍​‍‌‍喵‌​‍‍‌‍​‍‍‌‌​‍‍‌‌‍​‌‍‍‍​‍‍‌‍​‍‍‍‍‍​‌‌‌‍​‌‍‍‌​‌‌喵‌‌‍​‍‍‍‍‍​‍‌‌‍‌​‌‌‌‌‍‌喵。');
}
// 喵​‌‌‌​‍‍‍‍‍​‌‍‌‌​‌‌‍‌‌​‍‍​‍‍‌‌​‌‌​‌‍‌‌​‍‍​‌‌‍​喵‌‌​‍‌‍‍‍​‌‌‌​‍‌‌​‌‍‍‌‌​‍​‌‌‌​‍‌‌‌‌​‍‌‌‌‌​‍‍‌喵‍​‍‍​‍‌‍​‍‍‍‌‌​‍‌‌‍‌​‍‍​‍‍‍‍‌​‍‍‍‌‌​‌‍‍‍​‌‍‍‍喵‌​‌‍‍‌‌​‌‍‍‍​‍‌‌‌​‍‍‌​‍‌‌‌​‌‍‌‍‍​‍‍‍‍​‍‍‍‍‍​‍‍喵‌‌‌​‌‌‍‍‍​‍‌‍‌​‍‍‍​‌‍‍‌‍​‍‌‍‍‍​‌‌‌‍‌​‍‍‌​‌‌‍‌‍喵，​‍‌‍‌​‌‌‌‌‍​‍‌‌‌‍​‌‌​‌‍‍‍‍​‍‍‍‌​‍‌‍​‌‌​‍‍‌​‌‌‌喵‌‌​‍‍‍‍‌​‌‍​‍‌‌‍‍​‌‍‍‌​‍‌‍​‌‍‌‌​‍‍​‌‌‌‌‌​‍‍‍‍喵‍​‍‍‍‌‍​‍‌‍‍‌​‌‌‌‌‍​‍‍‍​‌‌​‍‍‌‍‍​‍‌‍‍​‌‌‌‌​‌‍‍喵～‌‌​‌‍‍‍​‌‌‌‌‌​‍‍‍‌‍​‌‌‍‌‍​‍‍‍‍‌​‌​‍‌‌‍‍​‌‍‌‌‍​喵‍‌‌‍‌​‌‌‍‌‍​‍‌‌‍‍​‌‍‌‍​‍‍‍‍‌​‍‌​‍‌‌‌‍​‌‌​‌‍‌喵‍‍​‌‌‍‌‌​‍‍‍​‌‍‍‌‌​‌‍‍‍​‌‍‌‍​‍‌‍​‌‍‍‌‌​‍‍‌‍‌​喵‌‌‌‌‍​‍‍‍‍‍​‌‍‍‌‌​‍‍‌‍‍​‌​‍‍‍‍‌​‍‍‍‌‌​‌‍‍‍​‍喵‍‍‌​‍‍‌​‌‌‍‌‌​‌‍‌​‌‌‌‍‍​‍‌‌‍‌​‌‌‍‌‍​‍‍‌‍‌​‌‌​‍喵‌‌‍‌​‌‍‌‌‍​‍‍‌‍‌​‌‌‌‍‍​‍‌‌‍‍​‌‍‌‌‍​‍‍‌​‌‌‌‌‍‌喵。
try {
    top.location.hostname;
    if (top.location.hostname !== window.location.hostname) {
        top.location.href = window.location.href;
    }
} catch (e) {
    top.location.href = window.location.href;
}